// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// 456 -> 5
// 782 -> 8
// 918 -> 1

// Console.WriteLine("Vvedite chislo 1");
// int input1 =int.Parse(Console.ReadLine());

// Console.WriteLine($"{input1/10%10}");

// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

// 645 -> 5

// 78 -> третьей цифры нет

// 32679 -> 6

// Console.WriteLine("Vvedite chislo 1");
// int input1 =int.Parse(Console.ReadLine());

// if (input1<100){
//     Console.WriteLine("3 chifri net");
// }else{
//     while (input1>999){
//         input1/=10;
//     }
//     Console.WriteLine($"{input1%10}");
// }

// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет

// Console.WriteLine("Vvedite chislo 1");
// int input1 =int.Parse(Console.ReadLine());

// if (input1==6||input1==7){
//     Console.WriteLine($"{input1} eto vihodnoi");
// }else{
//     if(input1>0 && input1<7){
//         Console.WriteLine($"{input1} eto ne vihodnoi");
//     }else{
//         Console.WriteLine($"{input1} eto ne den nedeli");
//     }
     
// }
